---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyAnimationSpeedText
source: html/3ffd019a-9cab-a6ad-5fc1-b72b0c9a3277.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyAnimationSpeedText Property

"Loop animation speed"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyAnimationSpeedText { get; }
```